       01  !PREFIX!array.
           05 !PREFIX!array-ptr usage pointer.
           05 !PREFIX!array-data.
              07 !PREFIX!array-element-sz pic 9(09) usage comp-4.
              07 !PREFIX!array-length pic 9(09) usage comp-4.
              07 !PREFIX!array-capacity pic 9(09) usage comp-4.